Revit 2027 API
ModelPath.CentralServerPath Property
 The path to the location of the central Revit server or cloud.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CentralServerPath { get; }
Public ReadOnly Property CentralServerPath As String
	Get
public:
property String^ CentralServerPath {
	String^ get ();
}
member CentralServerPath : string with get
Property Value
String
See Also
Reference
ModelPath Class
Autodesk.Revit.DB Namespace